[
	{
		"a": "spt",
		"t": "Este viaje de ida y vuelta lo llevar치 a trav칠s de las funciones principales de InfoRapid KnowledgeBase Builder."
	},
	{
		"a": "spt",
		"t": "Comencemos con un MindMap que creo insertando texto delineado."
	},
	{
		"m": "execInsertCommand",
		"p": [
			".id-outlinedtext"
		]
	},
	{
		"m": "waitUntilVisible",
		"p": [
			".kbb-text-input"
		]
	},
	{
		"m": "clickButton",
		"p": [
			".kbb-insert-example"
		]
	},
	{
		"m": "clickButton",
		"p": [
			".kbb-insert-outlinedtext-dialog + div>div>button:first-child"
		],
		"waudr": true,
		"wa": 500
	},
	{
		"a": "spt",
		"t": "Actualmente, el diagrama se muestra con un dise침o de mapa mental compacto. En este caso, sin embargo, un dise침o de mapa mental radial es m치s adecuado."
	},
	{
		"a": "spt",
		"t": "Tambi칠n puede elegir entre muchas otras opciones de dise침o, como un diagrama de flujo o un dise침o de red."
	},
	{
		"m": "setLayoutMode",
		"p": [
			".id-mindmap-circular-straight"
		]
	},
	{
		"a": "spt",
		"t": "En el siguiente paso, insertar칠 un nuevo elemento en el diagrama. La parte m치s importante de un elemento de diagrama es su nombre, que se muestra en el diagrama. KnowledgeBase Builder utiliza HTML para todos los textos. Por lo tanto, los nombres de los elementos tambi칠n pueden incluir tablas. Adem치s, puede especificar una descripci칩n, un hiperv칤nculo y una categor칤a. El texto de la descripci칩n se muestra como informaci칩n sobre herramientas al hacer clic en el elemento del diagrama. El hiperv칤nculo se muestra como un icono en la esquina superior izquierda del elemento y permite vincular p치ginas web. Muchos comandos afectan a todos los miembros de una categor칤a al mismo tiempo, de modo que, por ejemplo, todos los elementos de una categor칤a se muestran con el mismo formato."
	},
	{
		"m": "newItem",
		"p": [
			true,
			1,
			-1,
			"Nombre del elemento: se muestra en el diagrama",
			"2",
			"",
			"Nombre",
			"Valor",
			"Nombre",
			"Valor",
			"",
			"",
			"",
			"",
			"",
			"",
			"Descripci칩n del elemento: se mostrar치 como informaci칩n sobre herramientas cuando haga clic en el elemento",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"",
			"http://www.buildyourmap.com",
			"Nombre de categor칤a: el elemento es miembro de esta categor칤a"
		]
	},
	{
		"a": "spt",
		"t": "Los elementos desplegables mostrar치n el texto de la descripci칩n directamente en el diagrama."
	},
	{
		"m": "selectDiagramMode",
		"p": [
			".id-expand-items"
		]
	},
	{
		"a": "spt",
		"t": "Junto con cada elemento, se puede guardar una nota en formato HTML con im치genes, tablas y todas las opciones de formato que proporciona HTML. Los nombres y las descripciones de los elementos tambi칠n se guardan en formato HTML y ofrecen las mismas opciones de formato que las notas."
	},
	{
		"m": "setTextNote",
		"p": [
			5,
			-1,
			"Nota de texto en formato HTML",
			"2",
			"",
			"Nombre",
			"Valor",
			"Nombre",
			"Valor",
			"",
			"",
			"",
			"",
			"",
			""
		]
	},
	{
		"a": "spt",
		"t": "A continuaci칩n, creo cuatro elementos m치s y los conecto mediante l칤neas de relaci칩n."
	},
	{
		"m": "newItemName",
		"p": [
			true,
			2,
			-1,
			"游늰 Nombre de elemento"
		]
	},
	{
		"m": "newItemName",
		"p": [
			true,
			3,
			-1,
			"游꿉 Nombre de elemento"
		]
	},
	{
		"m": "newItemName",
		"p": [
			true,
			4,
			-1,
			"游 Nombre de elemento"
		]
	},
	{
		"m": "newItemName",
		"p": [
			true,
			5,
			-1,
			"游빓 Nombre de elemento"
		]
	},
	{
		"a": "spt",
		"t": "Para crear una nueva l칤nea de relaci칩n, primero haga clic en el elemento donde debe comenzar la l칤nea y arrastre el selector hasta el elemento donde debe terminar la l칤nea."
	},
	{
		"m": "newRelation",
		"p": [
			true,
			-1,
			0,
			-1,
			1
		]
	},
	{
		"m": "newRelation",
		"p": [
			true,
			-1,
			1,
			-1,
			2
		]
	},
	{
		"m": "newRelation",
		"p": [
			true,
			-1,
			2,
			-1,
			3
		]
	},
	{
		"m": "newRelation",
		"p": [
			true,
			-1,
			3,
			-1,
			4
		]
	},
	{
		"m": "newRelation",
		"p": [
			true,
			-1,
			4,
			-1,
			0
		]
	},
	{
		"a": "spt",
		"t": "Ahora mostremos un texto corto a lo largo de la l칤nea de relaci칩n. Primero selecciono la l칤nea y luego abro el cuadro de di치logo editar relaci칩n. Aqu칤 puedo ingresar tanto el texto para la relaci칩n hacia adelante como hacia atr치s. Normalmente, el texto de la relaci칩n directa es suficiente. Si ingreso ambos textos, el texto de la relaci칩n hacia atr치s se muestra en el caso de que el elemento final de la relaci칩n est칠 jer치rquicamente por encima del elemento inicial. Adem치s, al igual que con los elementos, puedo ingresar un texto de descripci칩n que se muestra en una informaci칩n sobre herramientas y una categor칤a."
	},
	{
		"m": "editRelation",
		"p": [
			-1,
			-1,
			0,
			"Nombre de la relaci칩n",
			"",
			"Nombre de relaci칩n hacia atr치s",
			"",
			"Descripci칩n de la relaci칩n: se mostrar치 como informaci칩n sobre herramientas cuando haga clic en la relaci칩n",
			"Nombre de categor칤a: la relaci칩n es miembro de esta categor칤a"
		]
	},
	{
		"a": "spt",
		"t": "Los elementos y las relaciones se pueden formatear de muchas maneras. Primero, selecciono el elemento o relaci칩n y luego cambio el color, la fuente y el estilo de l칤nea."
	},
	{
		"m": "setItemColor",
		"p": [
			-1,
			0,
			"81"
		]
	},
	{
		"m": "setItemFontSize",
		"p": [
			-1,
			0,
			".id-very-large-font-size"
		]
	},
	{
		"m": "setRelationColor",
		"p": [
			-1,
			-1,
			0,
			"51"
		]
	},
	{
		"m": "setRelationLineStyle",
		"p": [
			-1,
			-1,
			1,
			".id-dotted-line"
		]
	},
	{
		"a": "spt",
		"t": "Adem치s de la vista de diagrama regular, la aplicaci칩n tambi칠n ofrece una vista 3D y una vista de tabla."
	},
	{
		"a": "spt",
		"t": "Primero cambio a la vista 3D y hago girar el diagrama. Por cierto, la aplicaci칩n tambi칠n puede grabar y guardar un video del diagrama giratorio."
	},
	{
		"m": "clickQuickAccessToolbar",
		"p": [
			".id-show-3dview"
		]
	},
	{
		"m": "clickQuickAccessToolbarDirect",
		"p": [
			".id-rotate"
		],
		"wa": 3000
	},
	{
		"m": "clickQuickAccessToolbarDirect",
		"p": [
			".id-stop"
		]
	},
	{
		"a": "spt",
		"t": "En el siguiente paso, cambio a la vista de tabla y navego por los elementos secundarios."
	},
	{
		"m": "clickQuickAccessToolbar",
		"p": [
			".id-show-tableview"
		]
	},
	{
		"m": "clickQuickAccessToolbarDirect",
		"p": [
			".id-browse-mode"
		]
	},
	{
		"a": "ctvc",
		"col": 0,
		"row": 0,
		"wa": 500
	},
	{
		"a": "ctvc",
		"col": 0,
		"row": 1,
		"wa": 500
	},
	{
		"a": "ctvc",
		"col": 1,
		"row": 0,
		"wa": 500
	},
	{
		"a": "ctvc",
		"col": 2,
		"row": 0,
		"wa": 500
	},
	{
		"m": "closeLastTableViewColumn"
	},
	{
		"m": "closeLastTableViewColumn"
	},
	{
		"m": "closeLastTableViewColumn"
	},
	{
		"m": "clickQuickAccessToolbarDirect",
		"p": [
			".id-edit-mode"
		]
	},
	{
		"m": "clickQuickAccessToolbar",
		"p": [
			".id-show-diagramview"
		]
	},
	{
		"a": "spt",
		"t": "A continuaci칩n, creo un diagrama de flujo insertando un pseudoc칩digo y le muestro c칩mo cambiar de un dise침o horizontal a uno vertical."
	},
	{
		"m": "execInsertCommand",
		"p": [
			".id-pseudocode"
		]
	},
	{
		"m": "waitUntilVisible",
		"p": [
			".kbb-text-input"
		]
	},
	{
		"m": "clickButton",
		"p": [
			".kbb-insert-example"
		]
	},
	{
		"m": "clickButton",
		"p": [
			".kbb-insert-pseudocode-dialog + div>div>button:first-child"
		],
		"waudr": true,
		"wa": 500
	},
	{
		"a": "si",
		"ii": 30,
		"wa": 2000
	},
	{
		"a": "si",
		"ii": 0,
		"wa": 2000
	},
	{
		"m": "setLayoutMode",
		"p": [
			".id-flowchart-topbottom"
		]
	},
	{
		"a": "si",
		"ii": 30,
		"wa": 2000
	},
	{
		"a": "si",
		"ii": 0,
		"wa": 2000
	},
	{
		"a": "spt",
		"t": "Finalmente, vuelvo al primer diagrama buscando el nombre de su elemento ra칤z. Tambi칠n vuelvo a cambiar el dise침o al dise침o compacto de mapa mental."
	},
	{
		"m": "searchItemName",
		"p": [
			"Name 1"
		]
	},
	{
		"m": "setLayoutMode",
		"p": [
			".id-mindmap-circular-straight"
		]
	},
	{
		"a": "spt",
		"t": "Espero que esta breve introducci칩n haya despertado su inter칠s en nuestro programa. Si tiene alguna pregunta o sugerencia de mejora, comun칤quese conmigo por correo electr칩nico a info@inforapid.de. Y, por supuesto, estoy feliz con todos los usuarios que apoyan mi trabajo comprando la versi칩n paga."
	}
]
